[
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
        "category_id": "01",
        "rating": { "number": 4.5, "badge": "Excellent" },
        "enroll": 488,
        "title": "Web Design BootCamp-2022 for Beginners",
        "instructor": {
            "name": "Mr. Daniel",
            "duration": "3 months",
            "img": "https://i.ibb.co/6BtHHpj/charlie-green-3-Jmf-ENc-L24-M-unsplash.jpg"
        },
        "image_url": "https://images.pexels.com/photos/546819/pexels-photo-546819.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "details": "A web designer works on the appearance, layout, and, in some cases, content of a website. Appearance, for instance, relates to the colors, font, and images used. Layout refers to how information is structured and categorized. A good web design is easy to use, aesthetically pleasing, and suits the user group and brand of the website. Many webpages are designed with a focus on simplicity, so that no extraneous information and functionality that might distract or confuse users appears. As the keystone of a web designer's output is a site that wins and fosters the trust of the target audience, removing as many potential points of user frustration as possible is a critical consideration."
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
        "category_id": "02",
        "rating": { "number": 4.5, "badge": "Excellent" },
        "enroll": 488,
        "title": "Professional Graphics Design, PhotoShop, Adobe XD, Figma",
        "instructor": {
            "name": "Mr. Dev",
            "duration": "3 months",
            "img": "https://i.ibb.co/6BtHHpj/charlie-green-3-Jmf-ENc-L24-M-unsplash.jpg"
        },
        "image_url": "https://images.unsplash.com/photo-1626785774573-4b799315345d?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1471&q=80",
        "details": "Graphic design is an ancient craft, dating back past Egyptian hieroglyphs to at least 17,000-year-old cave paintings. It's a term that originated in the 1920s' print industry. It continues to cover a range of activities including logo creation. Graphic design in this sense concerns aesthetic appeal and marketing. Graphic designers attract viewers using images, color and typography. However, graphic designers working in user experience (UX) design must justify stylistic choices regarding, say, image locations and font with a human-centered approach. That means you need to focus on—and seek to empathize the most with—your specific users while you create good-looking designs that maximize usability. Aesthetics must serve a purpose—in UX design we don't create art for art's sake. "
    },

    {
        "_id": "f69a695f037cd9484cecaea37ca71011",
        
        "category_id": "03",
        "rating": { "number": 4.5, "badge": "Excellent" },
        "enroll": 488,
        "title": "UI/UX BootCamp for Beginners in 2022",
        "instructor": {
            "name": "Mr. Philipino",
            "duration": "3 months",
            "img": "https://i.ibb.co/6BtHHpj/charlie-green-3-Jmf-ENc-L24-M-unsplash.jpg"
        },
        "image_url": "https://images.unsplash.com/photo-1559028012-481c04fa702d?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1036&q=80",
        "details": "First things first: What do UX and UI actually mean? The people you have eavesdropped on are actually discussing two professions that, despite having been around for decades, and in theory for centuries, have been defined by the tech industry as UX and UI design. UX design refers to the term “user experience design”, while UI stands for “user interface design”. Both elements are crucial to a product and work closely together. But despite their professional relationship, the roles themselves are quite different, referring to very different aspects of the product development process and the design discipline."
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71012",
        
        "category_id": "04",
        "rating": { "number": 4.5, "badge": "Excellent" },
        "enroll": 488,
        "title": "Basic Web Development Course",
        "instructor": {
            "name": "Mr. Hayden",
            "duration": "3 months",
            "img": "https://i.ibb.co/6BtHHpj/charlie-green-3-Jmf-ENc-L24-M-unsplash.jpg"
        },
        "image_url": "https://images.unsplash.com/photo-1498050108023-c5249f4df085?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1472&q=80",
        "details": "The Internet isn't going anywhere. In fact, it's become a portal and primary method of research, connection, education, and entertainment in the world. As of 2021, there were 4.66 billion global Internet users — more than half the world's population. Given the rapidly-increasing number of Internet users, it's no surprise that web development is a rapidly expanding industry. Between now and 2030, the employment of web developers is expected to grow by 13%, much faster than most other technology careers. See why thousands of customers use CMS Hub to build an optimized website that integrates with their HubSpot CRM data and full marketing suite. In the next section, we'll tackle web development basics with answers to some common questions."
    },

    {
        "_id": "11468ed61aee84de492a8b04158a22f9",
        
        "category_id": "05",
        "rating": { "number": 4.5, "badge": "Excellent" },
        "enroll": 488,
        "title": "Search Engine Optimization - Basic",
        "instructor": {
            "name": "Mr. Robert",
            "duration": "3 months",
            "img": "https://i.ibb.co/6BtHHpj/charlie-green-3-Jmf-ENc-L24-M-unsplash.jpg"
        },
        "image_url": "https://images.pexels.com/photos/4960438/pexels-photo-4960438.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "details": "In today's world, we turn to Google to find the answers to pretty much all of our questions. So it's no wonder that business and website owners everywhere do what they can to make their information findable on Google. Which is exactly what SEO is—the practice of optimizing your content to appear higher within search results. The first step in accomplishing great SEO is creating a website on a platform that  facilitates easy customization and content updates, and provides the tools you need to optimize your site elements. We suggest using a website builder like Wix, which enables simple site updating and has built-in SEO tools."
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f0",
        
        "category_id": "06",
        "rating": { "number": 4.5, "badge": "Excellent" },
        "enroll": 488,
        "title": "Coding for Junior Basic Course",
        "instructor": {
            "name": "Mr. Peter",
            "duration": "3 months",
            "img": "https://i.ibb.co/6BtHHpj/charlie-green-3-Jmf-ENc-L24-M-unsplash.jpg"
        },
        "image_url": "https://images.pexels.com/photos/879109/pexels-photo-879109.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "details": "You've heard tons about coding and know that it has to do with computers and how they process the information we see. However, you may not have much more than this vague understanding of the concept. Don't feel bad. Many people don't really understand it, though we all depend on the fundamentals of code each and every day. It's such an important aspect of the technological landscape that, according to Fortune, former President Obama unveiled an initiative called “Computer Science for All” that has been backed by and invested in by big names, including the Turner Broadcasting Network. This movement is one that mirrors that of our nation's schools that have been emphasizing the value of technology, computer science, engineering, and other STEM-related topics. Read on to discover what computer code is and why it is of such importance in today's society."
    }
]